

%% 変数定義


R1 = 1;
R2 = 1;
R3 = 1;
R4 = 1;
R5 = 1;
R6 = 1;
% R7 = 1;
% R8 = 1;
% R9 = 1;
% R10 = 1;
% R11 = 1;
% R12 = 1;
% 


%% 行列定義
Matrix = [
    1/R1+1/R2, -1/R1, 0, -1/R2, 0, 0;  % 1行目
    -1/R1, 1/R1+1/R4+1/R5, -1/R5, 0, -1/R4, 0;  % 2行目
    0, -1/R5, 1/R5+1/R7, 0, 0, -1/R7;  % 3行目
    -1/R2, 0, 0, 1/R2+1/R3, -1/R3, 0;  % 4行目
    0, -1/R4, 0, -1/R3, 1/R3+1/R4+1/R6, -1/R6;  % 5行目
    0, 0, -1/R7, 0, -1/R6, 1/R6 + 1/R7   % 6行目
];

Iref = [1,0,0,0,0,-1]';

%チェック用
% Matrix
refMatrix = [Matrix Iref];

%rref化
[R,p]  = rref(refMatrix);


disp(R)
%やり方の一致を確認

